#მნიშნველობა:
#სერვერი არის სპეციალური კომპიუტერი ან პროგრამა, რომელიც მომხმარებლის მოთხოვნებს იღებს და პასუხს უშვებს. მაგალითად, ვებსერვერი არის კომპიუტერი, რომელიც ვებგვერდის ფაილებს ინახავს და მომხმარებლებს აწვდის.

#როგორ მუშაობს:
#როდესაც შენ ბრაუზერში ჩაწერ შენს საყვარელ ვებ-გვერდს, შენი კომპიუტერი (კლიენტი) სერვერს უგზავნის მოთხოვნას. სერვერი იღებს მოთხოვნას, გამოყოფს შესაბამის გვერდს ან ინფორმაციას და უშვებს შენს ბრაუზერში.

#მნიშნველობა:
#RAM არის კომპიუტერის მოკლევადიანი მეხსიერება, სადაც სისტემის აქტიური პროგრამები და მონაცემები ინახება. ეს მეხსიერება სწრაფია, მაგრამ ის შლის მონაცემებს კომპიუტერის გამორთვისთანავე.

#როგორ მუშაობს:
#როდესაც პროგრამას ან ვებგვერდს ასრულებ, მონაცემები შენს RAM-ში ჩაიტვირთება, რომ პროცესორი სწრაფად მიუწვდებოდეს. მეტი RAM ნიშნავს, რომ კომპიუტერს შეუძლია ერთდროულად ბევრი რამ გააკეთოს.

